       IDENTIFICATION DIVISION.
       PROGRAM-ID. FACTORIAL.
       AUTHOR. DION VILLAGARCIA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 NUMBER1   PIC 9(9).
       01 FACTORIAL PIC 9(9) VALUE 1.
       01 COUNTER   PIC 99   VALUE 1.

       01 DISP-FAC  PIC ZZZZZZZZ9.
       01 DISP-NUM  PIC ZZZZZZZZ9.

       PROCEDURE DIVISION.

       MAIN-PROGRAM.
           DISPLAY "Input a number: " WITH NO ADVANCING
           ACCEPT NUMBER1.

           PERFORM UNTIL COUNTER > NUMBER1
              COMPUTE FACTORIAL = FACTORIAL * COUNTER
              ADD 1 TO COUNTER
           END-PERFORM.

           MOVE FACTORIAL TO DISP-FAC
           MOVE NUMBER1 TO DISP-NUM

           DISPLAY "The factorial of " FUNCTION TRIM(DISP-NUM)
           " is " FUNCTION TRIM(DISP-FAC)

           STOP RUN.