       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP_NAME.
       AUTHOR. DION VILLAGARCIA.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           PERFORM 5 TIMES
                   DISPLAY "DION"
           END-PERFORM.

           STOP RUN.